# ================================JamesKid============================== 
# @author		: JamesKid  
# @description : this is note about awk 
# @change		:
# ======================================================================
# 选择
	# 选择第二个字段大于5的行,并输出第二个字段
		awk '$2>5 {print $2}'
# 连接字符
	# awk字符串转数字
		awk 'BEGIN{a="100";b="10test10";print (a+b+0);}' #只需要将变量通过”+”连接运算。自动强制将字符串转为整型。非数字变成0，发现第一个非数字字符，后面自动忽略。
	# awk数字转为字符串
		awk 'BEGIN{a=100;b=100;c=(a""b);print c}'     #100100 只需要将变量与””符号连接起来运算即可。
	# awk字符串连接操作
		awk 'BEGIN{a="a";b="b";c=(a""b);print c}'     #ab
		awk 'BEGIN{a="a";b="b";c=(a+b);print c}'      #0 字符串连接操作通”二“，”+”号操作符。模式强制将左右2边的值转为 数字类型。然后进行操作。
