<?php
/* ================================VimKid============================== 
* @author       : VimKid  
* @title        : 冒泡排序
* @description  : 介绍冒泡排序算法原理及代码
* @算法原理     : 两个相邻的数比较大小，小的往左移动，大的往右移动,             
*
* @算法复杂度   : 时间复杂度 最优　最坏  平均
*               : 空间复杂度
*
* @序列变化     排序原序列: 8 7 3 2 5 9 4 11
*               第一次排序: 7 3 2 5 8 4 11 9  
*               第二次排序: 3 2 5 7 4 8 9 11 
*               第三次排序: 2 3 5 4 7 8 9 11 
*               第四次排序: 2 3 4 5 7 8 9 11 
*
* @算法优点
*
* @算法缺点
*
*               
*
* ======================================================================
 */

/* @params numberList  数字列表
 */
$numberList = array();


?>
